
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   16.1   Copyright 1985-2019 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 24-core Stata perpetual license:
       Serial number:  501606209668
         Licensed to:  Goldman School of Public Policy
                       University of California, Berkeley

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do 1_uninteracted_regression.do 

. /*
> Purpose: Estimate and Plot stacked global energy-temperature response
> */
. 
. clear all

. set more off

. macro drop _all

. global LOG: env LOG

. log using $LOG/1_uninteracted_regression.log
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/liruixue/repos_release/LOG/1_uninteracted_regression.log
  log type:  text
 opened on:   9 Aug 2021, 09:41:55

. 
. 
. /////////////// SET UP USER SPECIFIC PATHS //////////////////////////////////
> ////////////////////
> 
. global REPO: env REPO

. global DATA: env DATA 

. global OUTPUT: env OUTPUT 

. 
. // path to energy-code-release repo 
. 
. global root "${REPO}/energy-code-release-2020"

. 
. /////////////////////////////////////////////////////////////////////////////
> ////////////////////
> 
. ******Set Script Toggles*****************************************************
> ***
. 
. // What model do you want? TINV_clim or TINV_clim_EX
. global model "TINV_clim"

. 
. *****************************************************************************
> ***
. * Step 1: Estimate Response
. *****************************************************************************
> ***
. 
. do $root/1_analysis/uninteracted_regression/stacked.do

. /*
> 
> Purpose: Estimate stacked global energy-temperature response
> 
> */
. 
. ****** Set Model Specification Locals ***************************************
> ***
. local model "$model"

. 
. *****************************************************************************
> ***
. * Step 1: Load Data
. *****************************************************************************
> ***
. 
. use "$DATA/regression/GMFD_`model'_regsort.dta", clear

. 
. *****************************************************************************
> ***
. * Step 2: Generate Population Weights for FD and FD_FGLS Regressions
. *****************************************************************************
> ***
. 
. //Generate population weights of countries relative to world in a year
. bysort year product flow: egen year_product_flow_total_pop = total(pop)  

. gen pop_weight = pop / year_product_flow_total_pop

.                                         
. 
. *****************************************************************************
> ***
. * Step 3: Prepare Regressors and Run Regression
. *****************************************************************************
> ***
. 
. //time set
. sort region_i year 

. tset region_i year
       panel variable:  region_i (unbalanced)
        time variable:  year, 1971 to 2010, but with gaps
                delta:  1 unit

. 
. * precip
. 
. local precip_r = ""

. 
. forval pg=1/2 {
  2.         forval k = 1/2 {
  3.                 local precip_r = "`precip_r' c.indp`pg'#c.indf1#c.FD_preci
> p`k'_GMFD"
  4.         }               
  5. }

. 
. * temp
. 
. local temp_r = ""

. 
. forval pg=1/2 {
  2.         forval k=1/4 {
  3.                 local temp_r = "`temp_r' c.indp`pg'#c.indf1#c.FD_temp`k'_G
> MFD"
  4.         }
  5. }               

.                                 
. // run first stage regression
. reghdfe FD_load_pc `temp_r' `precip_r' [pw=pop_weight], absorb(i.flow_i#i.pro
> duct_i#i.year#i.subregionid) cluster(region_i) residuals(resid)
(dropped 106 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =      7,614
Absorbing 1 HDFE group                            F(  12,    500) =       1.29
Statistics robust to heteroskedasticity           Prob > F        =     0.2229
                                                  R-squared       =     0.4015
                                                  Adj R-squared   =     0.3263
                                                  Within R-sq.    =     0.0023
Number of clusters (region_i) =        501        Root MSE        =     1.0091

                             (Std. Err. adjusted for 501 clusters in region_i)
------------------------------------------------------------------------------
             |               Robust
  FD_load_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     c.indp1#|
     c.indf1#|
          c. |
FD_temp1_G~D |  -.0001546   .0001378    -1.12   0.262    -.0004252    .0001161
             |
     c.indp1#|
     c.indf1#|
          c. |
FD_temp2_G~D |   3.18e-06   6.07e-06     0.52   0.600    -8.74e-06    .0000151
             |
     c.indp1#|
     c.indf1#|
          c. |
FD_temp3_G~D |   3.26e-07   2.98e-07     1.09   0.275    -2.60e-07    9.12e-07
             |
     c.indp1#|
     c.indf1#|
          c. |
FD_temp4_G~D |  -7.53e-09   8.60e-09    -0.88   0.382    -2.44e-08    9.37e-09
             |
     c.indp2#|
     c.indf1#|
          c. |
FD_temp1_G~D |   -.001274   .0008892    -1.43   0.153     -.003021    .0004729
             |
     c.indp2#|
     c.indf1#|
          c. |
FD_temp2_G~D |    .000031   .0000482     0.64   0.520    -.0000637    .0001257
             |
     c.indp2#|
     c.indf1#|
          c. |
FD_temp3_G~D |   1.41e-06   1.93e-06     0.73   0.465    -2.38e-06    5.19e-06
             |
     c.indp2#|
     c.indf1#|
          c. |
FD_temp4_G~D |  -4.02e-08   4.83e-08    -0.83   0.406    -1.35e-07    5.47e-08
             |
     c.indp1#|
     c.indf1#|
          c. |
FD_precip1~D |  -.0000515    .000042    -1.23   0.221    -.0001341     .000031
             |
     c.indp1#|
     c.indf1#|
          c. |
FD_precip2~D |  -1.91e-07   2.79e-07    -0.68   0.495    -7.39e-07    3.58e-07
             |
     c.indp2#|
     c.indf1#|
          c. |
FD_precip1~D |  -.0000818   .0001359    -0.60   0.547    -.0003488    .0001852
             |
     c.indp2#|
     c.indf1#|
          c. |
FD_precip2~D |  -1.02e-06   9.19e-07    -1.11   0.270    -2.82e-06    7.90e-07
             |
       _cons |   .1477908   .0141447    10.45   0.000     .1200003    .1755812
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------------------------------
> --+
                             Absorbed FE | Categories  - Redundant  = Num. Coef
> s                                                                            
>   |
-----------------------------------------+-------------------------------------
> --|
       flow_i#product_i#year#subregionid |       839           0         839   
>                                                                              
>   |
-------------------------------------------------------------------------------
> --+

. estimates save "$OUTPUT/sters/FD_global_`model'", replace
file /home/liruixue/energy_data_release/OUTPUT/sters/FD_global_TINV_clim.ster s
> aved

.                                         
. 
. 
. // Generate FGLS weights using Equation for weights, given that we also have 
> pop weights here
. 
. //Generate count variable to identify singletons (ie for use in the replace l
> ine below)
. drop if resid == .
(687 observations deleted)

. 
. bysort region_i: gen count = _N

. 
. // Generate the relative population weights within a FE for variance weightin
> g
. bysort region_i: egen sum_of_weights_in_FE = total(pop_weight)

. gen for_variance_weighting = pop_weight / sum_of_weights_in_FE

. 
. // Generate the weighted mean at the fixed effect level    
. gen weighted_residual = for_variance_weighting * resid

. bysort region_i: egen weighted_mean_resid_FE_level = mean(weighted_residual)

.                                         
. // Calculate the weighted variance within each fixed effect 
. gen square_term_weighted = for_variance_weighting * (resid - weighted_mean_re
> sid_FE_level)^2

. bysort region_i: egen weighted_residual_variance = total(square_term_weighted
> )    

. 
. // Calculate the FGLS weighs which are the pop weights divided by the varianc
> e weights in each FE found above 
. gen FGLS_weight = pop_weight / (weighted_residual_variance)

. 
. // Rounding error in stata can mean we dont get exactly zero weights for thes
> e when (resid - weighted_mean_resid_FE_level) should be zero. Drop them
. drop if count == 1
(51 observations deleted)

. 
. //run second stage FGLS regression
. reghdfe FD_load_pc `temp_r' `precip_r' [pw=FGLS_weight], absorb(i.flow_i#i.pr
> oduct_i#i.year#i.subregionid) cluster(region_i)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =      7,563
Absorbing 1 HDFE group                            F(  12,    449) =       2.05
Statistics robust to heteroskedasticity           Prob > F        =     0.0192
                                                  R-squared       =     0.9626
                                                  Adj R-squared   =     0.9578
                                                  Within R-sq.    =     0.0078
Number of clusters (region_i) =        450        Root MSE        =     0.0216

                             (Std. Err. adjusted for 450 clusters in region_i)
------------------------------------------------------------------------------
             |               Robust
  FD_load_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     c.indp1#|
     c.indf1#|
          c. |
FD_temp1_G~D |    .000013   .0000557     0.23   0.815    -.0000964    .0001224
             |
     c.indp1#|
     c.indf1#|
          c. |
FD_temp2_G~D |  -1.93e-07   3.00e-06    -0.06   0.949    -6.09e-06    5.70e-06
             |
     c.indp1#|
     c.indf1#|
          c. |
FD_temp3_G~D |   3.80e-08   1.50e-07     0.25   0.800    -2.57e-07    3.33e-07
             |
     c.indp1#|
     c.indf1#|
          c. |
FD_temp4_G~D |  -1.14e-09   2.38e-09    -0.48   0.632    -5.81e-09    3.53e-09
             |
     c.indp2#|
     c.indf1#|
          c. |
FD_temp1_G~D |  -.0008855   .0004387    -2.02   0.044    -.0017476   -.0000234
             |
     c.indp2#|
     c.indf1#|
          c. |
FD_temp2_G~D |   6.71e-06    .000022     0.30   0.761    -.0000365    .0000499
             |
     c.indp2#|
     c.indf1#|
          c. |
FD_temp3_G~D |   1.19e-06   1.31e-06     0.90   0.366    -1.39e-06    3.77e-06
             |
     c.indp2#|
     c.indf1#|
          c. |
FD_temp4_G~D |  -2.48e-08   2.03e-08    -1.22   0.223    -6.47e-08    1.51e-08
             |
     c.indp1#|
     c.indf1#|
          c. |
FD_precip1~D |  -.0000243   .0000124    -1.95   0.051    -.0000487    1.45e-07
             |
     c.indp1#|
     c.indf1#|
          c. |
FD_precip2~D |   1.26e-07   6.52e-08     1.93   0.054    -2.24e-09    2.54e-07
             |
     c.indp2#|
     c.indf1#|
          c. |
FD_precip1~D |  -.0001184   .0000527    -2.25   0.025    -.0002219   -.0000148
             |
     c.indp2#|
     c.indf1#|
          c. |
FD_precip2~D |   1.25e-07   2.89e-07     0.43   0.665    -4.43e-07    6.94e-07
             |
       _cons |   .0523786   .0001652   317.01   0.000     .0520539    .0527033
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------------------------------
> --+
                             Absorbed FE | Categories  - Redundant  = Num. Coef
> s                                                                            
>   |
-----------------------------------------+-------------------------------------
> --|
       flow_i#product_i#year#subregionid |       839           0         839   
>                                                                              
>   |
-------------------------------------------------------------------------------
> --+

. estimates save "$OUTPUT/sters/FD_FGLS_global_`model'", replace
file /home/liruixue/energy_data_release/OUTPUT/sters/FD_FGLS_global_TINV_clim.s
> ter saved

. 
. 
end of do-file

. 
. *****************************************************************************
> ***
. * Step 2: Plot Response
. *****************************************************************************
> ***
. 
. do $root/1_analysis/uninteracted_regression/plot_stacked.do

. /*
> 
> Purpose: Plot stacked global energy-temperature response regression (Figure A
> .5 in the paper)
> 
> */
. 
. set scheme s1color

. 
. ****** Set Model Specification Locals ***************************************
> ***
. 
. local model = "$model"

. 
. ****** Set Plotting Toggles *************************************************
> ***
. 
. // plotting color and color name for title
. 
. * electricity 
. local electricity_col "dknavy"

. local electricity_colTT "Blue"

. 
. * other energy 
. local other_energy_col "dkorange"

. local other_energy_colTT "Orange"

.                         
. *****************************************************************************
> ***
. * Step 1: Load Data and Clean for Plotting
. *****************************************************************************
> ***
.                 
. use "$DATA/regression/GMFD_`model'_regsort.dta", clear

. 
. //Set up locals for plotting
. local obs = 35 + abs(-5) + 1

. 
. //clean data for plotting
. drop if _n > 0
(8,301 observations deleted)

. set obs `obs'
number of observations (_N) was 0, now 41

. 
. replace temp1_GMFD = _n - 6
(41 real changes made)

. 
. foreach k of num 1/4 {
  2.         rename temp`k'_GMFD temp`k'
  3.         replace temp`k' = temp1 ^ `k'
  4. }
(0 real changes made)
(41 real changes made)
(41 real changes made)
(41 real changes made)

. 
. *****************************************************************************
> ***
. * Step 2: Plot, Plot, Plot
. *****************************************************************************
> ***
. 
. 
. // set up plotting locals
. loc SE ""

. loc nonSE ""

. local colorGuide ""     

. 
. foreach var in "electricity" "other_energy" {
  2. 
.         // assign product index
.         if "`var'"=="electricity" {
  3.                 local pg=1
  4.         }
  5.         else if "`var'"=="other_energy" {
  6.                 local pg=2
  7.         }
  8. 
.         * construct local variable that holds dose response
.         
.         local line = ""
  9.         local add = ""
 10.         
.         forval k = 1/4 {
 11. 
.                 local line = "`line'`add'_b[c.indp`pg'#c.indf1#c.FD_temp`k'_G
> MFD] * (temp`k' - 20^`k')"
 12.                 local add " + "
 13. 
.         } 
 14. 
.         * use ster to estimate dose response
. 
.         estimates use "$OUTPUT/sters/FD_FGLS_global_`model'"
 15.         predictnl yhat_`var' = `line', se(se_`var') ci(lower_`var' upper_`
> var')
 16.         
.         // add predicted dose reponse to plotting locals
.         loc SE = "`SE' rarea upper_`var' lower_`var' temp1, col(``var'_col'%3
> 0) || line yhat_`var' temp1, lc (``var'_col') ||"
 17.         loc noSE "`noSE' line yhat_`var' temp1, lc (``var'_col') ||"
 18.         loc colorGuide = "`colorGuide' `var' (``var'_colTT')"
 19. 
. }
note: confidence intervals calculated using Z critical values
note: confidence intervals calculated using Z critical values

. 
. //plot with SE
