
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   16.1   Copyright 1985-2019 StataCorp LLC
  Statistics/Data analysis            StataCorp
                                      4905 Lakeway Drive
     Special Edition                  College Station, Texas 77845 USA
                                      800-STATA-PC        https://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Stata license: 745-user network, expiring 30 Jun 2022
Serial number: 501709313533
  Licensed to: Ruixue Li
               UChicago BFI

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. Maximum number of variables is set to 5,000; see help set_maxvar.

. do 2_decile_regression.do 

. 
. /*
> Purpose: Estimate and Plot stacked income decile energy-temperature response
> */
. 
. clear all

. set more off

. macro drop _all

. 
. /////////////// SET UP USER SPECIFIC PATHS //////////////////////////////////
> ////////////////////
> 
. global REPO: env REPO

. global DATA: env DATA 

. global OUTPUT: env OUTPUT

. global LOG: env LOG

. log using $LOG/1_analysis/2_decile_regression.log, replace
(note: file /Users/ruixueli/Downloads/energy_data_release/LOG/1_analysis/2_deci
> le_regression.log not found)
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/ruixueli/Downloads/energy_data_release/LOG/1_analysis/2_dec
> ile_regression.log
  log type:  text
 opened on:   7 Sep 2021, 05:08:08

. 
. 
. * path to energy-code-release repo:
. 
. global root "${REPO}/energy-code-release-2020"

. 
. /////////////////////////////////////////////////////////////////////////////
> ////////////////////
> 
. ******Set Script Toggles*****************************************************
> ***
. 
. // What model do you want? TINV_clim or TINV_clim_EX
. global model "TINV_clim"

. 
. *****************************************************************************
> ***
. * Step 1: Estimate Response
. *****************************************************************************
> ***
. 
. do $root/1_analysis/decile_regression/stacked.do

. /*
> 
> Purpose: Estimate stacked income decile regression (generate sters)
> 
> */
. 
. ****** Set Model Specification Locals ***************************************
> ***
. 
. local model = "$model"

.                         
. *****************************************************************************
> ***
. *Step 1: Load Data
. *****************************************************************************
> ***
.                 
. use "$DATA/regression/GMFD_`model'_regsort.dta", `clear'

. 
. *****************************************************************************
> ***
. * Step 2: Prepare Regressors and Run Regression
. *****************************************************************************
> ***
. 
. * set fixed effect
. 
. * set time
. sort region_i year 

. xtset region_i year
       panel variable:  region_i (unbalanced)
        time variable:  year, 1971 to 2010, but with gaps
                delta:  1 unit

. 
. * income decile dummies
. 
. forval pg=1/2 {
  2.         forval lg=1/10 {
  3.                 qui gen DumIncG`lg'F1P`pg' = (ind`lg'- L1.ind`lg') * indf1
>  * indp`pg'
  4.         }
  5. }

. 
. * income decile x temp
. 
. local income_decile_temp_r = ""

. 
. forval pg = 1/2 {
  2.         forval lg = 1/10 {
  3.                 forval k = 1/2 {
  4.                         local income_decile_temp_r = "`income_decile_temp_
> r' c.indp`pg'#c.indf1#c.FD_I`lg'temp`k'_GMFD"
  5.                 }
  6.         }               
  7. }       

. 
. * precip
. 
. local precip_r = ""

. 
. forval pg=1/2 {
  2.         forval k = 1/2 {
  3.                 local precip_r = "`precip_r' c.indp`pg'#c.indf1#c.FD_preci
> p`k'_GMFD"
  4.         }               
  5. }

.         
. * run first stage regression
. reghdfe FD_load_pc `income_decile_temp_r' `precip_r' DumInc*, absorb(i.flow_i
> #i.product_i#i.year#i.subregionid) cluster(region_i) residuals(resid)
(dropped 106 singleton observations)
(MWFE estimator converged in 1 iterations)
note: DumIncG10F1P1 omitted because of collinearity
note: DumIncG10F1P2 omitted because of collinearity

HDFE Linear regression                            Number of obs   =      7,614
Absorbing 1 HDFE group                            F(  62,    500) =       1.86
Statistics robust to heteroskedasticity           Prob > F        =     0.0002
                                                  R-squared       =     0.1230
                                                  Adj R-squared   =     0.0055
                                                  Within R-sq.    =     0.0072
Number of clusters (region_i) =        501        Root MSE        =     3.7821

                             (Std. Err. adjusted for 501 clusters in region_i)
------------------------------------------------------------------------------
             |               Robust
  FD_load_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     c.indp1#|
     c.indf1#|
          c. |
FD_I1temp1~D |  -.0001374   .0002394    -0.57   0.566    -.0006077    .0003329
             |
     c.indp1#|
     c.indf1#|
          c. |
FD_I1temp2~D |   1.23e-06   4.86e-06     0.25   0.800    -8.32e-06    .0000108
             |
     c.indp1#|
     c.indf1#|
          c. |
FD_I2temp1~D |   .0000309   .0002362     0.13   0.896    -.0004331    .0004949
             |
     c.indp1#|
     c.indf1#|
          c. |
FD_I2temp2~D |  -2.62e-06   4.88e-06    -0.54   0.591    -.0000122    6.96e-06
             |
     c.indp1#|
     c.indf1#|
          c. |
FD_I3temp1~D |  -.0001324   .0002047    -0.65   0.518    -.0005347    .0002699
             |
     c.indp1#|
     c.indf1#|
          c. |
FD_I3temp2~D |   2.84e-06   4.13e-06     0.69   0.491    -5.26e-06    .0000109
             |
     c.indp1#|
     c.indf1#|
          c. |
FD_I4temp1~D |   -.000048   .0002121    -0.23   0.821    -.0004648    .0003687
             |
     c.indp1#|
     c.indf1#|
          c. |
FD_I4temp2~D |   1.12e-07   4.82e-06     0.02   0.981    -9.36e-06    9.58e-06
             |
     c.indp1#|
     c.indf1#|
          c. |
FD_I5temp1~D |   .0000509   .0002352     0.22   0.829    -.0004112    .0005129
             |
     c.indp1#|
     c.indf1#|
          c. |
FD_I5temp2~D |  -3.13e-06   5.16e-06    -0.61   0.545    -.0000133    7.02e-06
             |
     c.indp1#|
     c.indf1#|
          c. |
FD_I6temp1~D |  -.0002062   .0002767    -0.75   0.457    -.0007498    .0003375
             |
     c.indp1#|
     c.indf1#|
          c. |
FD_I6temp2~D |   5.63e-06   7.26e-06     0.77   0.439    -8.64e-06    .0000199
             |
     c.indp1#|
     c.indf1#|
          c. |
FD_I7temp1~D |  -.0005651   .0003575    -1.58   0.115    -.0012674    .0001372
             |
     c.indp1#|
     c.indf1#|
          c. |
FD_I7temp2~D |    .000017   9.59e-06     1.77   0.077    -1.84e-06    .0000358
             |
     c.indp1#|
     c.indf1#|
          c. |
FD_I8temp1~D |  -.0005459   .0003074    -1.78   0.076    -.0011499    .0000581
             |
     c.indp1#|
     c.indf1#|
          c. |
FD_I8temp2~D |   .0000173   9.12e-06     1.90   0.059    -6.33e-07    .0000352
             |
     c.indp1#|
     c.indf1#|
          c. |
FD_I9temp1~D |  -.0011578   .0004967    -2.33   0.020    -.0021337   -.0001819
             |
     c.indp1#|
     c.indf1#|
          c. |
FD_I9temp2~D |   .0000393   .0000157     2.50   0.013     8.48e-06    .0000702
             |
     c.indp1#|
     c.indf1#|
          c. |
FD_I10temp1~ |  -.0012041   .0006825    -1.76   0.078    -.0025451    .0001368
             |
     c.indp1#|
     c.indf1#|
          c. |
FD_I10temp2~ |   .0000426    .000022     1.94   0.053    -6.19e-07    .0000859
             |
     c.indp2#|
     c.indf1#|
          c. |
FD_I1temp1~D |  -.0008052    .001261    -0.64   0.523    -.0032827    .0016723
             |
     c.indp2#|
     c.indf1#|
          c. |
FD_I1temp2~D |   4.85e-06   .0000312     0.16   0.877    -.0000565    .0000662
             |
     c.indp2#|
     c.indf1#|
          c. |
FD_I2temp1~D |  -.0018799   .0012622    -1.49   0.137    -.0043598    .0005999
             |
     c.indp2#|
     c.indf1#|
          c. |
FD_I2temp2~D |   .0000394   .0000305     1.29   0.198    -.0000206    .0000994
             |
     c.indp2#|
     c.indf1#|
          c. |
FD_I3temp1~D |  -.0023621   .0010571    -2.23   0.026    -.0044391   -.0002851
             |
     c.indp2#|
     c.indf1#|
          c. |
FD_I3temp2~D |   .0000514   .0000312     1.64   0.101    -9.99e-06    .0001127
             |
     c.indp2#|
     c.indf1#|
          c. |
FD_I4temp1~D |  -.0016981    .000923    -1.84   0.066    -.0035115    .0001152
             |
     c.indp2#|
     c.indf1#|
          c. |
FD_I4temp2~D |   .0000338   .0000288     1.17   0.241    -.0000228    .0000904
             |
     c.indp2#|
     c.indf1#|
          c. |
FD_I5temp1~D |  -.0012095   .0011556    -1.05   0.296      -.00348     .001061
             |
     c.indp2#|
     c.indf1#|
          c. |
FD_I5temp2~D |  -2.66e-06   .0000301    -0.09   0.930    -.0000618    .0000565
             |
     c.indp2#|
     c.indf1#|
          c. |
FD_I6temp1~D |  -.0003184    .000929    -0.34   0.732    -.0021438    .0015069
             |
     c.indp2#|
     c.indf1#|
          c. |
FD_I6temp2~D |  -.0000351   .0000263    -1.33   0.183    -.0000868    .0000166
             |
     c.indp2#|
     c.indf1#|
          c. |
FD_I7temp1~D |  -.0022304    .000959    -2.33   0.020    -.0041146   -.0003461
             |
     c.indp2#|
     c.indf1#|
          c. |
FD_I7temp2~D |   .0000198   .0000305     0.65   0.516    -.0000401    .0000797
             |
     c.indp2#|
     c.indf1#|
          c. |
FD_I8temp1~D |   -.001642    .001125    -1.46   0.145    -.0038522    .0005682
             |
     c.indp2#|
     c.indf1#|
          c. |
FD_I8temp2~D |   4.06e-06    .000044     0.09   0.927    -.0000824    .0000905
             |
     c.indp2#|
     c.indf1#|
          c. |
FD_I9temp1~D |  -.0020474   .0012808    -1.60   0.111    -.0045638    .0004691
             |
     c.indp2#|
     c.indf1#|
          c. |
FD_I9temp2~D |   4.09e-06   .0000583     0.07   0.944    -.0001104    .0001186
             |
     c.indp2#|
     c.indf1#|
          c. |
FD_I10temp1~ |   .0011512    .002719     0.42   0.672    -.0041908    .0064933
             |
     c.indp2#|
     c.indf1#|
          c. |
FD_I10temp2~ |  -.0000866   .0001118    -0.77   0.439    -.0003064    .0001331
             |
     c.indp1#|
     c.indf1#|
          c. |
FD_precip1~D |   .0000649   .0000549     1.18   0.238    -.0000429    .0001726
             |
     c.indp1#|
     c.indf1#|
          c. |
FD_precip2~D |  -4.77e-07   2.81e-07    -1.70   0.090    -1.03e-06    7.41e-08
             |
     c.indp2#|
     c.indf1#|
          c. |
FD_precip1~D |   .0000319   .0005119     0.06   0.950    -.0009738    .0010376
             |
     c.indp2#|
     c.indf1#|
          c. |
FD_precip2~D |  -2.09e-06   2.97e-06    -0.70   0.482    -7.94e-06    3.75e-06
             |
DumIncG1F1P1 |  -1.865279   1.427578    -1.31   0.192     -4.67007    .9395107
DumIncG2F1P1 |  -2.520197   1.386708    -1.82   0.070     -5.24469    .2042958
DumIncG3F1P1 |  -2.230117   1.396123    -1.60   0.111    -4.973107    .5128733
DumIncG4F1P1 |  -2.344569   1.365881    -1.72   0.087    -5.028143    .3390045
DumIncG5F1P1 |  -2.429675   1.258877    -1.93   0.054    -4.903015    .0436649
DumIncG6F1P1 |  -1.970357   1.183476    -1.66   0.097    -4.295556    .3548412
DumIncG7F1P1 |  -1.042191   1.104953    -0.94   0.346    -3.213114    1.128733
DumIncG8F1P1 |  -.9501491    .998346    -0.95   0.342    -2.911619    1.011321
DumIncG9F1P1 |  -.0073936   .8425789    -0.01   0.993    -1.662825    1.648038
DumIncG10F~1 |          0  (omitted)
DumIncG1F1P2 |  -6.247242   5.642022    -1.11   0.269    -17.33223     4.83775
DumIncG2F1P2 |  -4.516815   5.744072    -0.79   0.432    -15.80231    6.768677
DumIncG3F1P2 |  -2.576678   5.232034    -0.49   0.623    -12.85616    7.702802
DumIncG4F1P2 |  -3.215464   5.240766    -0.61   0.540     -13.5121    7.081172
DumIncG5F1P2 |  -.9805338    5.17798    -0.19   0.850    -11.15381    9.192746
DumIncG6F1P2 |  -.9063443   4.910794    -0.18   0.854    -10.55468     8.74199
DumIncG7F1P2 |   4.869366   4.245197     1.15   0.252    -3.471257    13.20999
DumIncG8F1P2 |    4.17579   4.222651     0.99   0.323    -4.120537    12.47212
DumIncG9F1P2 |   7.012091   3.327294     2.11   0.036     .4748912    13.54929
DumIncG10F~2 |          0  (omitted)
       _cons |   .0202895   .0653203     0.31   0.756    -.1080464    .1486255
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------------------------------
> --+
                             Absorbed FE | Categories  - Redundant  = Num. Coef
> s                                                                            
>   |
-----------------------------------------+-------------------------------------
> --|
       flow_i#product_i#year#subregionid |       839           0         839   
>                                                                              
>   |
-------------------------------------------------------------------------------
> --+

. estimates save "$OUTPUT/sters/FD_income_decile_`model'", replace        
file //Users/ruixueli/Downloads/energy_data_release/OUTPUT/sters/FD_income_deci
> le_TINV_clim.ster saved

.                         
. * calculating weigts for FGLS
. drop if resid==.
(687 observations deleted)

. bysort region_i: egen omega = var(resid)
(51 missing values generated)

. qui gen weight = 1/omega

.                                 
. * run second stage FGLS regression
. reghdfe FD_load_pc `income_decile_temp_r' `precip_r' DumInc* [pw=weight], abs
> orb(i.flow_i#i.product_i#i.year#i.subregionid) cluster(region_i)
(MWFE estimator converged in 1 iterations)
note: DumIncG10F1P1 omitted because of collinearity
note: DumIncG10F1P2 omitted because of collinearity

HDFE Linear regression                            Number of obs   =      7,563
Absorbing 1 HDFE group                            F(  62,    449) =       4.64
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.4328
                                                  Adj R-squared   =     0.3562
                                                  Within R-sq.    =     0.0333
Number of clusters (region_i) =        450        Root MSE        =     0.1323

                             (Std. Err. adjusted for 450 clusters in region_i)
------------------------------------------------------------------------------
             |               Robust
  FD_load_pc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     c.indp1#|
     c.indf1#|
          c. |
FD_I1temp1~D |  -.0000462   .0000336    -1.38   0.169    -.0001122    .0000198
             |
     c.indp1#|
     c.indf1#|
          c. |
FD_I1temp2~D |   5.33e-07   7.60e-07     0.70   0.484    -9.61e-07    2.03e-06
             |
     c.indp1#|
     c.indf1#|
          c. |
FD_I2temp1~D |   .0000598   .0000513     1.17   0.244     -.000041    .0001606
             |
     c.indp1#|
     c.indf1#|
          c. |
FD_I2temp2~D |  -1.91e-06   1.16e-06    -1.65   0.099    -4.19e-06    3.62e-07
             |
     c.indp1#|
     c.indf1#|
          c. |
FD_I3temp1~D |   2.82e-06   .0000649     0.04   0.965    -.0001248    .0001305
             |
     c.indp1#|
     c.indf1#|
          c. |
FD_I3temp2~D |  -4.12e-07   1.58e-06    -0.26   0.795    -3.52e-06    2.70e-06
             |
     c.indp1#|
     c.indf1#|
          c. |
FD_I4temp1~D |   .0000558   .0000671     0.83   0.406    -.0000762    .0001877
             |
     c.indp1#|
     c.indf1#|
          c. |
FD_I4temp2~D |  -1.82e-06   1.67e-06    -1.09   0.276    -5.09e-06    1.46e-06
             |
     c.indp1#|
     c.indf1#|
          c. |
FD_I5temp1~D |   .0000357   .0000812     0.44   0.660    -.0001239    .0001954
             |
     c.indp1#|
     c.indf1#|
          c. |
FD_I5temp2~D |  -8.37e-07   2.02e-06    -0.41   0.678    -4.80e-06    3.13e-06
             |
     c.indp1#|
     c.indf1#|
          c. |
FD_I6temp1~D |   .0001181   .0000998     1.18   0.237    -.0000781    .0003143
             |
     c.indp1#|
     c.indf1#|
          c. |
FD_I6temp2~D |  -1.97e-06   2.64e-06    -0.75   0.456    -7.17e-06    3.22e-06
             |
     c.indp1#|
     c.indf1#|
          c. |
FD_I7temp1~D |  -.0001475   .0000958    -1.54   0.125    -.0003359    .0000409
             |
     c.indp1#|
     c.indf1#|
          c. |
FD_I7temp2~D |   5.92e-06   2.93e-06     2.02   0.044     1.67e-07    .0000117
             |
     c.indp1#|
     c.indf1#|
          c. |
FD_I8temp1~D |  -.0002002   .0001267    -1.58   0.115    -.0004492    .0000489
             |
     c.indp1#|
     c.indf1#|
          c. |
FD_I8temp2~D |   8.34e-06   3.48e-06     2.40   0.017     1.50e-06    .0000152
             |
     c.indp1#|
     c.indf1#|
          c. |
FD_I9temp1~D |  -.0005652   .0001613    -3.50   0.001    -.0008821   -.0002482
             |
     c.indp1#|
     c.indf1#|
          c. |
FD_I9temp2~D |   .0000219   5.05e-06     4.33   0.000     .0000119    .0000318
             |
     c.indp1#|
     c.indf1#|
          c. |
FD_I10temp1~ |  -.0011696   .0002294    -5.10   0.000    -.0016204   -.0007188
             |
     c.indp1#|
     c.indf1#|
          c. |
FD_I10temp2~ |   .0000415   6.83e-06     6.08   0.000     .0000281    .0000549
             |
     c.indp2#|
     c.indf1#|
          c. |
FD_I1temp1~D |    .000051   .0003324     0.15   0.878    -.0006022    .0007043
             |
     c.indp2#|
     c.indf1#|
          c. |
FD_I1temp2~D |  -2.04e-06   7.22e-06    -0.28   0.778    -.0000162    .0000122
             |
     c.indp2#|
     c.indf1#|
          c. |
FD_I2temp1~D |    .000158   .0003167     0.50   0.618    -.0004643    .0007804
             |
     c.indp2#|
     c.indf1#|
          c. |
FD_I2temp2~D |  -3.51e-06   6.93e-06    -0.51   0.613    -.0000171    .0000101
             |
     c.indp2#|
     c.indf1#|
          c. |
FD_I3temp1~D |  -.0004749   .0003823    -1.24   0.215    -.0012261    .0002764
             |
     c.indp2#|
     c.indf1#|
          c. |
FD_I3temp2~D |   9.91e-06   8.84e-06     1.12   0.263    -7.47e-06    .0000273
             |
     c.indp2#|
     c.indf1#|
          c. |
FD_I4temp1~D |  -.0004525   .0004444    -1.02   0.309    -.0013258    .0004208
             |
     c.indp2#|
     c.indf1#|
          c. |
FD_I4temp2~D |   1.29e-06   .0000108     0.12   0.905    -.0000198    .0000224
             |
     c.indp2#|
     c.indf1#|
          c. |
FD_I5temp1~D |  -.0011494   .0004706    -2.44   0.015    -.0020743   -.0002244
             |
     c.indp2#|
     c.indf1#|
          c. |
FD_I5temp2~D |   .0000182   .0000118     1.54   0.124    -4.98e-06    .0000413
             |
     c.indp2#|
     c.indf1#|
          c. |
FD_I6temp1~D |  -.0012019   .0005126    -2.34   0.019    -.0022094   -.0001945
             |
     c.indp2#|
     c.indf1#|
          c. |
FD_I6temp2~D |   .0000176   .0000144     1.23   0.221    -.0000106    .0000459
             |
     c.indp2#|
     c.indf1#|
          c. |
FD_I7temp1~D |  -.0027101   .0005633    -4.81   0.000    -.0038171   -.0016031
             |
     c.indp2#|
     c.indf1#|
          c. |
FD_I7temp2~D |   .0000596   .0000146     4.09   0.000     .0000309    .0000882
             |
     c.indp2#|
     c.indf1#|
          c. |
FD_I8temp1~D |  -.0016106   .0004603    -3.50   0.001    -.0025152    -.000706
             |
     c.indp2#|
     c.indf1#|
          c. |
FD_I8temp2~D |   .0000278   .0000118     2.35   0.019     4.55e-06    .0000511
             |
     c.indp2#|
     c.indf1#|
          c. |
FD_I9temp1~D |  -.0027632   .0005623    -4.91   0.000    -.0038682   -.0016582
             |
     c.indp2#|
     c.indf1#|
          c. |
FD_I9temp2~D |    .000055   .0000164     3.36   0.001     .0000229    .0000872
             |
     c.indp2#|
     c.indf1#|
          c. |
FD_I10temp1~ |     -.0026   .0007795    -3.34   0.001    -.0041319   -.0010681
             |
     c.indp2#|
     c.indf1#|
          c. |
FD_I10temp2~ |    .000045   .0000203     2.21   0.027     5.04e-06     .000085
             |
     c.indp1#|
     c.indf1#|
          c. |
FD_precip1~D |   7.52e-06   8.14e-06     0.92   0.356    -8.48e-06    .0000235
             |
     c.indp1#|
     c.indf1#|
          c. |
FD_precip2~D |  -2.46e-08   3.89e-08    -0.63   0.527    -1.01e-07    5.19e-08
             |
     c.indp2#|
     c.indf1#|
          c. |
FD_precip1~D |  -.0000801   .0000574    -1.39   0.164     -.000193    .0000328
             |
     c.indp2#|
     c.indf1#|
          c. |
FD_precip2~D |   3.39e-07   3.80e-07     0.89   0.373    -4.08e-07    1.09e-06
             |
DumIncG1F1P1 |  -1.750115   .6758142    -2.59   0.010    -3.078267   -.4219635
DumIncG2F1P1 |  -2.122292   .6738196    -3.15   0.002    -3.446524   -.7980605
DumIncG3F1P1 |  -1.937758   .7172616    -2.70   0.007    -3.347365   -.5281516
DumIncG4F1P1 |  -2.058698   .7177704    -2.87   0.004    -3.469305   -.6480919
DumIncG5F1P1 |  -2.032377   .7172033    -2.83   0.005    -3.441869   -.6228854
DumIncG6F1P1 |  -2.420216   .7245479    -3.34   0.001    -3.844142   -.9962902
DumIncG7F1P1 |  -1.671894   .6604113    -2.53   0.012    -2.969775    -.374013
DumIncG8F1P1 |  -1.527086   .4578101    -3.34   0.001    -2.426803   -.6273698
DumIncG9F1P1 |  -.9793003   .3620872    -2.70   0.007    -1.690896   -.2677043
DumIncG10F~1 |          0  (omitted)
DumIncG1F1P2 |  -12.43722    3.09243    -4.02   0.000    -18.51466    -6.35979
DumIncG2F1P2 |   -13.1265   2.834524    -4.63   0.000    -18.69709   -7.555924
DumIncG3F1P2 |  -10.32824   2.850853    -3.62   0.000    -15.93091   -4.725563
DumIncG4F1P2 |  -8.468254   2.928522    -2.89   0.004    -14.22357   -2.712942
DumIncG5F1P2 |  -6.221502   2.772186    -2.24   0.025    -11.66957   -.7734326
DumIncG6F1P2 |  -5.762883   2.623655    -2.20   0.029    -10.91905   -.6067162
DumIncG7F1P2 |   -1.00691    2.56257    -0.39   0.695    -6.043031    4.029211
DumIncG8F1P2 |   -3.50433   2.561223    -1.37   0.172    -8.537803    1.529142
DumIncG9F1P2 |   .1060155   2.313122     0.05   0.963    -4.439874    4.651905
DumIncG10F~2 |          0  (omitted)
       _cons |   .0254946    .004141     6.16   0.000     .0173565    .0336327
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------------------------------
> --+
                             Absorbed FE | Categories  - Redundant  = Num. Coef
> s                                                                            
>   |
-----------------------------------------+-------------------------------------
> --|
       flow_i#product_i#year#subregionid |       839           0         839   
>                                                                              
>   |
-------------------------------------------------------------------------------
> --+

. estimates save "$OUTPUT/sters/FD_FGLS_income_decile_`model'", replace   
file //Users/ruixueli/Downloads/energy_data_release/OUTPUT/sters/FD_FGLS_income
> _decile_TINV_clim.ster saved

. 
. 
end of do-file

. 
. *****************************************************************************
> ***
. * Step 2: Plot Response
. *****************************************************************************
> ***
. 
. do $root/1_analysis/decile_regression/plot_stacked.do

. /*
> 
> Purpose: Plot a product overlay of the income decile x temperature energy tem
> perature response 
> (Figure 1.A in the paper)
> 
> */
. 
. set scheme s1color

. 
. ****** Set Model Specification Locals ***************************************
> ***
. 
. local model = "$model"

. 
. ****** Set Plotting Toggles *************************************************
> ***
. 
. // plotting color and color name for title
. 
. * electricity 
. local electricity_col "dknavy"

. local electricity_colTT "Blue"

. 
. * other energy 
. local other_energy_col "dkorange"

. local other_energy_colTT "Orange"

.                         
. *****************************************************************************
> ***
. *Step 1: Load Data and Clean for Plotting
. *****************************************************************************
> ***
.                 
. use "$DATA/regression/GMFD_`model'_regsort.dta", clear

. 
. //Set up locals for plotting
. local obs = 35 + abs(-5) + 1

. 
. //clean data for plotting
. drop if _n > 0
(8,301 observations deleted)

. set obs `obs'
number of observations (_N) was 0, now 41

. 
. replace temp1_GMFD = _n - 6
(41 real changes made)

. 
. foreach k of num 1/2 {
  2.         rename temp`k'_GMFD temp`k'
  3.         replace temp`k' = temp1 ^ `k'
  4. }
(0 real changes made)
(41 real changes made)

. 
. *****************************************************************************
> ***
. * Step 2: Plot Plot Plot
. *****************************************************************************
> ***
. 
. // loop over income deciles
. forval lg=1/10 {
  2.                         
.         // set up plotting locals
.         local SE ""
  3.         local noSE ""
  4.         local colorGuide ""     
  5. 
.         foreach var in "electricity" "other_energy" {
  6. 
.                 // assign product index
.                 if "`var'" == "electricity" {
  7.                         local pg = 1
  8.                 }
  9.                 else if "`var'" == "other_energy" {
 10.                         local pg=2
 11.                 }
 12. 
.                 * construct local variable that holds dose response
.                 
.                 local line = ""
 13.                 local add = ""
 14.                 
.                 forval k = 1/2 {
 15. 
.                         local line = "`line'`add'_b[c.indp`pg'#c.indf1#c.FD_I
> `lg'temp`k'] * (temp`k' - 20^`k')"
 16.                         local add " + "
 17. 
.                 } 
 18. 
.                 * use ster to estimate dose response
. 
.                 estimates use "$OUTPUT/sters/FD_FGLS_income_decile_`model'"
 19.                 predictnl yhat`lg'_`var' = `line', se(se`lg'_`var') ci(low
> er`lg'_`var' upper`lg'_`var')
 20. 
.                 *describe, fullname
. 
.                 // add predicted dose reponse to plotting locals
.                 loc SE = "`SE' rarea upper`lg'_`var' lower`lg'_`var' temp1, c
> ol(``var'_col'%30) || line yhat`lg'_`var' temp1, lc (``var'_col') ||"
 21.                 loc noSE "`noSE' line yhat`lg'_`var' temp1, lc (``var'_col
> ') ||"
 22.                 loc colorGuide = "`colorGuide' `var' (``var'_colTT')"
 23. 
.         }
 24.         
. 
.         //plot with SE
.         tw `SE' , ///
>         yline(0, lwidth(vthin)) xlabel(-5(10)35, labsize(vsmall)) ///
>         ylabel(, labsize(vsmall) nogrid) legend(off) ///
>         subtitle("", size(vsmall) color(dkgreen)) ///
>         ytitle("", size(small)) xtitle("", size(small)) ///
>         plotregion(color(white)) graphregion(color(white)) nodraw ///
>         name(addgraph`lg', replace)
 25. 
.         //add graphic for combined plotting later
.         local graphic = "`graphic' addgraph`lg'"
 26.         local graphic_noSE = "`graphic_noSE' addgraph`lg'_noSE"
 27. }                               
note: confidence intervals calculated using Z critical values
note: confidence intervals calculated using Z critical values
note: confidence intervals calculated using Z critical values
note: confidence intervals calculated using Z critical values
note: confidence intervals calculated using Z critical values
note: confidence intervals calculated using Z critical values
note: confidence intervals calculated using Z critical values
note: confidence intervals calculated using Z critical values
note: confidence intervals calculated using Z critical values
note: confidence intervals calculated using Z critical values
note: confidence intervals calculated using Z critical values
note: confidence intervals calculated using Z critical values
note: confidence intervals calculated using Z critical values
note: confidence intervals calculated using Z critical values
note: confidence intervals calculated using Z critical values
note: confidence intervals calculated using Z critical values
note: confidence intervals calculated using Z critical values
note: confidence intervals calculated using Z critical values
note: confidence intervals calculated using Z critical values
note: confidence intervals calculated using Z critical values

. 
. *list temp1 yhat10_electricity
.                                                         
.         
. // plot and save combined plot with SE
. graph combine `graphic', imargin(zero) ycomm rows(1) xsize(20) ysize(3) ///
> title("Poly 2 Income Decile Energy Temperature Response (`model')", size(smal
> l)) ///
> subtitle("`colorGuide'", size(small)) ///
> plotregion(color(white)) graphregion(color(white)) name(comb, replace)

. graph export "$OUTPUT/figures/fig_1A_product_overlay_income_decile_`model'.pd
> f", replace
(file //Users/ruixueli/Downloads/energy_data_release/OUTPUT/figures/fig_1A_prod
> uct_overlay_income_decile_TINV_clim.pdf written in PDF format)

. 
.                         
. graph drop _all 

. 
end of do-file

. 
. *****************************************************************************
> ***
. * Step 3: Plot Response separately for electricity and other energy
. *****************************************************************************
> ***
. 
. do $root/1_analysis/decile_regression/plot_stacked_1A_separate.do

. /*
> 
> Purpose: Plot the energy/other energy separated version of 1A
> 
> */
. 
. foreach fuel in "electricity" "other_energy" {
  2.         set scheme s1color
  3. 
.         ****** Set Model Specification Locals *******************************
> ***********
. 
.         local model = "$model"
  4. 
.         ****** Set Plotting Toggles *****************************************
> ***********
. 
.         // plotting color and color name for title
. 
.         * electricity 
.         local electricity_col "dknavy"
  5.         local electricity_colTT "Blue"
  6. 
.         * other energy 
.         local other_energy_col "dkorange"
  7.         local other_energy_colTT "Orange"
  8.                                 
.         *********************************************************************
> ***********
.         *Step 1: Load Data and Clean for Plotting
.         *********************************************************************
> ***********
.                         
.         use "$DATA/regression/GMFD_`model'_regsort.dta", clear
  9. 
.         //Set up locals for plotting
.         local obs = 35 + abs(-5) + 1
 10. 
.         //clean data for plotting
.         drop if _n > 0
 11.         set obs `obs'
 12. 
.         replace temp1_GMFD = _n - 6
 13. 
.         foreach k of num 1/2 {
 14.                 rename temp`k'_GMFD temp`k'
 15.                 replace temp`k' = temp1 ^ `k'
 16.         }
 17. 
.         *********************************************************************
> ***********
.         * Step 2: Plot Plot Plot
.         *********************************************************************
> ***********
.         local graphic ""
 18.         local graphic_noSE ""
 19. 
.         // loop over income deciles
.         forval lg=1/10 {
 20.                                 
.                 // set up plotting locals
.                 local SE ""
 21.                 local noSE ""
 22.                 local colorGuide ""     
 23. 
.                 foreach var in `fuel' {
 24. 
.                         // assign product index
.                         if "`var'" == "electricity" {
 25.                                 local pg = 1
 26.                         }
 27.                         else if "`var'" == "other_energy" {
 28.                                 local pg=2
 29.                         }
 30. 
.                         * construct local variable that holds dose response
.                         
.                         local line = ""
 31.                         local add = ""
 32.                         
.                         forval k = 1/2 {
 33. 
.                                 local line = "`line'`add'_b[c.indp`pg'#c.indf
> 1#c.FD_I`lg'temp`k'] * (temp`k' - 20^`k')"
 34.                                 local add " + "
 35. 
.                         } 
 36. 
.                         * use ster to estimate dose response
. 
.                         estimates use "$OUTPUT/sters/FD_FGLS_income_decile_`m
> odel'"
 37.                         predictnl yhat`lg'_`var' = `line', se(se`lg'_`var'
> ) ci(lower`lg'_`var' upper`lg'_`var')
 38.                         
.                         // add predicted dose reponse to plotting locals
.                         loc SE = "`SE' rarea upper`lg'_`var' lower`lg'_`var' 
> temp1, col(``var'_col'%30) || line yhat`lg'_`var' temp1, lc (``var'_col') ||"
 39.                         loc noSE "`noSE' line yhat`lg'_`var' temp1, lc (``
> var'_col') ||"
 40.                         loc colorGuide = "`colorGuide' `var' (``var'_colTT
> ')"
 41. 
.                 }
 42.                 
. 
. 
.                 //plot with SE
.                 tw `SE' , ///
>                 yline(0, lwidth(vthin)) xlabel(-5(10)35, labsize(vsmall)) ///
>                 ylabel(, labsize(vsmall) nogrid) legend(off) ///
>                 subtitle("", size(vsmall) color(dkgreen)) ///
>                 ytitle("", size(small)) xtitle("", size(small)) ///
>                 plotregion(color(white)) graphregion(color(white)) nodraw ///
>                 name(addgraph`lg', replace)
 43. 
.                 //add graphic for combined plotting later
.                 local graphic = "`graphic' addgraph`lg'"
 44.                 local graphic_noSE = "`graphic_noSE' addgraph`lg'_noSE"
 45.         }                               
 46.                                                                           
>       
.         // plot and save combined plot with SE
.         graph combine `graphic', imargin(zero) ycomm rows(1) xsize(20) ysize(
> 3) ///
>         title("Poly 2 Income Decile Electricity Temperature Response (`model'
> )", size(small)) ///
>         subtitle("`colorGuide'", size(small)) ///
>         plotregion(color(white)) graphregion(color(white)) name(comb, replace
> )
 47.         graph export "$OUTPUT/figures/fig_1A_`fuel'_income_decile_`model'.
> pdf", replace
 48.                 
.         graph drop _all 
 49. 
. }
(8,301 observations deleted)
number of observations (_N) was 0, now 41
(41 real changes made)
(0 real changes made)
(41 real changes made)
note: confidence intervals calculated using Z critical values
note: confidence intervals calculated using Z critical values
note: confidence intervals calculated using Z critical values
note: confidence intervals calculated using Z critical values
note: confidence intervals calculated using Z critical values
note: confidence intervals calculated using Z critical values
note: confidence intervals calculated using Z critical values
note: confidence intervals calculated using Z critical values
note: confidence intervals calculated using Z critical values
note: confidence intervals calculated using Z critical values
(file //Users/ruixueli/Downloads/energy_data_release/OUTPUT/figures/fig_1A_elec
> tricity_income_decile_TINV_clim.pdf written in PDF format)
(8,301 observations deleted)
number of observations (_N) was 0, now 41
(41 real changes made)
(0 real changes made)
(41 real changes made)
note: confidence intervals calculated using Z critical values
note: confidence intervals calculated using Z critical values
note: confidence intervals calculated using Z critical values
note: confidence intervals calculated using Z critical values
note: confidence intervals calculated using Z critical values
note: confidence intervals calculated using Z critical values
note: confidence intervals calculated using Z critical values
note: confidence intervals calculated using Z critical values
note: confidence intervals calculated using Z critical values
note: confidence intervals calculated using Z critical values
(file //Users/ruixueli/Downloads/energy_data_release/OUTPUT/figures/fig_1A_othe
> r_energy_income_decile_TINV_clim.pdf written in PDF format)

. 
. 
end of do-file

. 
. log close _all
      name:  <unnamed>
       log:  /Users/ruixueli/Downloads/energy_data_release/LOG/1_analysis/2_dec
> ile_regression.log
  log type:  text
 closed on:   7 Sep 2021, 05:08:34
-------------------------------------------------------------------------------

. 
. 
end of do-file
